app/controllers/api_controller.rb

  def index
  	entries = Entry.all

  	# collect associated entities into separate arrays
  	categories = []
  	entries.includes(:categories).each do |entry|
---
SELECT "entries".* FROM "entries"
SELECT "has_categories".* FROM "has_categories" WHERE "has_categories"."entry_id" IN (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13)