app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories"
---
  def index
	result = {}
	Category.all.each{ |category| result[category.id] = {name: category.name, parent_id: category.parent_id} }

INSERT INTO "categories" ("name", "parent_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "concert"], ["parent_id", 2], ["created_at", "2015-05-25 14:13:54.683978"], ["updated_at", "2015-05-25 14:13:54.683978"]]
---
  def create
	render json: Category.create(category_params)

UPDATE "categories" SET "name" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["name", "concerts"], ["updated_at", "2015-05-25 14:14:14.499979"], ["id", 8]]
---
  def update
	render json: Category.update(params[:id], category_params)