app/controllers/entries_controller.rb

  def search
	queries = params['query'].split(' ');
	entries = Entry.joins(:categories)
---
SELECT "categories".* FROM "categories" INNER JOIN "has_categories" ON "categories"."id" = "has_categories"."category_id" WHERE "has_categories"."entry_id" = ?  [["entry_id", 1]]
SELECT "entries".* FROM "entries" INNER JOIN "has_categories" ON "has_categories"."entry_id" = "entries"."id" INNER JOIN "categories" ON "categories"."id" = "has_categories"."category_id" WHERE (entries.name like '%bio%' or city like '%bio%' or categories.name like '%bio%') AND (entries.name like '%worms%' or city like '%worms%' or categories.name like '%worms%') AND (entries.name like '%ref%' or city like '%ref%' or categories.name like '%ref%')

  def index
        render json: Entry.all
---
SELECT "entries".* FROM "entries"

  def create
	entry = Entry.create(entry_params)
---
INSERT INTO "entries" ("name", "description", "position", "city", "zip", "street", "phone", "openingHours", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
	entry = Entry.update(params[:id], entry_params)
---
UPDATE "entries" SET "name" = ?, "updated_at" = ? WHERE "entries"."id" = ?  [["name", "Weltladen2"], ["updated_at", "2015-05-25 12:18:29.515169"], ["id", 1]]